Repository: phmatray/BlazorKawaii
Catalog: Demo/Resources/SharedResource.*.resx
Languages: es, fr, nl

# CommonIssue1Solution
source: Ensure you've added the necessary imports to _Imports.razor
es: Asegúrese de haber agregado las importaciones necesarias a _Imports.razor
nl: Zorg ervoor dat u de benodigde imports aan _Imports.razor hebt toegevoegd

# CommonIssue2
source: SVG scaling issues
es: Problemas de escalado SVG
nl: SVG-schaalproblems

# CommonIssue2Solution
source: Check that the parent container has appropriate dimensions
es: Verifique que el contenedor padre tenga dimensiones apropiadas
nl: Controleer of de bovenliggende container de juiste afmetingen heeft

# CommonIssue3
source: Colors not applying correctly
es: Los colores no se aplican correctamente
nl: Kleuren worden niet correct toegepast

# CommonIssue3Solution
source: Verify that color values are in valid hex format (#RRGGBB)
es: Verifique que los valores de color estén en formato hexadecimal válido (#RRGGBB)
nl: Controleer of kleurwaarden in een geldig hexadecimaal formaat zijn (#RRGGBB)

# NeedMoreHelp
source: Need more help? Visit our
es: ¿Necesita más ayuda? Visite nuestro
nl: Meer hulp nodig? Bezoek onze

source: Color
fr: Couleur
nl: Kleur
