Repository: phmatray/BlazorKawaii
Catalog: Demo/Resources/SharedResource.*.resx
Languages: es, fr, nl

source: Home
es: Inicio
fr: Accueil
nl: Thuis

source: Components
es: Componentes
fr: Composants
nl: Componenten

source: Playground
es: Área de Pruebas
fr: Terrain de jeu
nl: Speeltuin

source: Documentation
es: Documentación
nl: Documentatie

# HomeTitle
source: Cute SVG components for Blazor
es: Componentes SVG adorables para Blazor
fr: Composants SVG mignons pour Blazor
nl: Schattige SVG-componenten voor Blazor

# HomeSubtitle
source: A collection of customizable kawaii illustrations for your Blazor applications
es: Una colección de ilustraciones kawaii personalizables para tus aplicaciones Blazor
fr: Une collection d'illustrations kawaii personnalisables pour vos applications Blazor
nl: Een collectie aanpasbare kawaii-illustraties voor je Blazor-applicaties

source: View Components
es: Ver Componentes
fr: Voir les composants
nl: Bekijk Componenten

source: Features
es: Características
fr: Fonctionnalités
nl: Functies

# ComponentsCount
source: 12 Components
es: 12 Componentes
fr: 12 Composants
nl: 12 Componenten

# ComponentsCountDesc
source: Diverse collection of kawaii illustrations
es: Diversa colección de ilustraciones kawaii
fr: Collection diversifiée d'illustrations kawaii
nl: Diverse collectie kawaii-illustraties

# MoodsCount
source: 7 Moods
es: 7 Estados de Ánimo
fr: 7 Humeurs
nl: 7 Stemmingen

# MoodsCountDesc
source: Express different emotions
es: Expresa diferentes emociones
fr: Exprimer différentes émotions
nl: Druk verschillende emoties uit

source: Fully Customizable
es: Totalmente Personalizable
fr: Entièrement personnalisable
nl: Volledig Aanpasbaar

# FullyCustomizableDesc
source: Size, color, and mood options
es: Opciones de tamaño, color y estado de ánimo
fr: Options de taille, couleur et humeur
nl: Grootte-, kleur- en stemmingsopties

source: Quick Start
es: Inicio Rápido
fr: Démarrage rapide
nl: Snel Starten

# Install
source: Install the package
es: Instalar el paquete
fr: Installer le package
nl: Installeer het pakket

# Import
source: Import the namespace
es: Importar el espacio de nombres
fr: Importer l'espace de noms
nl: Importeer de namespace

# UseComponent
source: Use a component
es: Usar un componente
fr: Utiliser un composant
nl: Gebruik een component

source: Welcome to Blazor Kawaii
es: Bienvenido a Blazor Kawaii
fr: Bienvenue sur Blazor Kawaii
nl: Welkom bij Blazor Kawaii

# CuteCustomizableSVGComponents
source: Cute, customizable SVG components for your Blazor applications
es: Componentes SVG adorables y personalizables para tus aplicaciones Blazor
fr: Composants SVG mignons et personnalisables pour vos applications Blazor
nl: Schattige, aanpasbare SVG-componenten voor je Blazor-applicaties

source: Try Playground
es: Probar Área de Pruebas
fr: Essayer le terrain de jeu
nl: Probeer Speeltuin

source: View Docs
es: Ver Documentación
fr: Voir la documentation
nl: Bekijk Docs

source: See Them in Action
es: Verlos en Acción
fr: Voyez-les en action
nl: Zie ze in actie

# SevenMoods
source: 7 Moods
es: 7 Estados de Ánimo
fr: 7 Humeurs
nl: 7 Stemmingen

# ExpressDifferentEmotions
source: Express different emotions with built-in mood presets
es: Expresa diferentes emociones con estados de ánimo predefinidos
fr: Exprimez différentes émotions avec des préréglages d'humeur intégrés
nl: Druk verschillende emoties uit met ingebouwde stemmingsvoorinstellingen

# ChangeColorsAndSizes
source: Change colors, sizes, and moods to match your design
es: Cambia colores, tamaños y estados de ánimo para que coincidan con tu diseño
fr: Modifiez les couleurs, les tailles et les humeurs pour correspondre à votre design
nl: Pas kleuren, groottes en stemmingen aan om bij je ontwerp te passen

source: Blazing Fast
es: Súper Rápido
fr: Ultra rapide
nl: Bliksemsnel

# LightweightSVGComponents
source: Lightweight SVG components with zero dependencies
es: Componentes SVG ligeros sin dependencias
fr: Composants SVG légers sans aucune dépendance
nl: Lichtgewicht SVG-componenten zonder afhankelijkheden

source: Kawaii Components
es: Componentes Kawaii
fr: Composants Kawaii
nl: Kawaii Componenten

source: Mood Expressions
es: Expresiones de Ánimo
fr: Expressions d'humeur
nl: Stemmingsuitdrukkingen

source: Customizations
es: Personalizaciones
fr: Personnalisations
nl: Aanpassingen

# ItsAsEasyAs
source: It's as easy as importing a component and using it:
es: Es tan fácil como importar un componente y usarlo:
fr: C'est aussi simple que d'importer un composant et de l'utiliser :
nl: Het is zo eenvoudig als een component importeren en gebruiken:

source: Ready to make your app kawaii?
es: ¿Listo para hacer tu aplicación kawaii?
fr: Prêt à rendre votre application kawaii ?
nl: Klaar om je app kawaii te maken?

# ExploreAllComponents
source: Explore all components and customize them to your liking
es: Explora todos los componentes y personalízalos a tu gusto
fr: Explorez tous les composants et personnalisez-les à votre goût
nl: Verken alle componenten en pas ze aan naar wens

source: Browse Components
es: Explorar Componentes
fr: Parcourir les composants
nl: Blader door Componenten

# ComponentsTitle
source: Component Gallery
es: Galería de Componentes
fr: Galerie de composants
nl: Componentengalerij

# ComponentsSubtitle
source: Explore all available kawaii components
es: Explora todos los componentes kawaii disponibles
fr: Explorez tous les composants kawaii disponibles
nl: Verken alle beschikbare kawaii-componenten

source: Search components...
es: Buscar componentes...
fr: Rechercher des composants...
nl: Zoek componenten...

source: View Details
es: Ver Detalles
fr: Voir les détails
nl: Bekijk Details

source: Default Size
es: Tamaño Predeterminado
fr: Taille par défaut
nl: Standaardgrootte

source: Default Color
es: Color Predeterminado
fr: Couleur par défaut
nl: Standaardkleur

source: Usage
es: Uso
fr: Utilisation
nl: Gebruik

source: Close
es: Cerrar
fr: Fermer
nl: Sluiten

source: Filter by mood
es: Filtrar por estado de ánimo
fr: Filtrer par humeur
nl: Filter op stemming

source: Default Values:
es: Valores Predeterminados:
fr: Valeurs par défaut :
nl: Standaardwaarden:

source: Available Moods:
es: Estados de Ánimo Disponibles:
fr: Humeurs disponibles :
nl: Beschikbare Stemmingen:

source: View Code
es: Ver Código
fr: Voir le code
nl: Bekijk Code

source: Try in Playground
es: Probar en Área de Pruebas
fr: Essayer dans le terrain de jeu
nl: Probeer in Speeltuin

source: Code Example
es: Ejemplo de Código
fr: Exemple de code
nl: Codevoorbeeld

source: Copy Code
es: Copiar Código
fr: Copier le code
nl: Kopieer Code

source: Code copied to clipboard!
es: ¡Código copiado al portapapeles!
fr: Code copié dans le presse-papiers !
nl: Code gekopieerd naar klembord!

# BasicUsageComment
source: Basic usage
es: Uso básico
fr: Utilisation de base
nl: Basisgebruik

# WithCustomPropertiesComment
source: With custom properties
es: Con propiedades personalizadas
fr: Avec des propriétés personnalisées
nl: Met aangepaste eigenschappen

# AllMoodsExampleComment
source: All moods example
es: Ejemplo de todos los estados de ánimo
fr: Exemple avec toutes les humeurs
nl: Alle stemmingen voorbeeld

# BackpackDesc
source: A cute backpack with straps and pockets
es: Una mochila adorable con correas y bolsillos
fr: Un joli sac à dos avec des bretelles et des poches
nl: Een schattige rugzak met riemen en zakken

# BrowserDesc
source: Web browser window with address bar
es: Ventana de navegador web con barra de direcciones
fr: Fenêtre de navigateur web avec barre d'adresse
nl: Webbrowservenster met adresbalk

# CatDesc
source: Adorable cat with ears and whiskers
es: Gato adorable con orejas y bigotes
fr: Chat adorable avec des oreilles et des moustaches
nl: Schattige kat met oren en snorharen

# ChocolateDesc
source: Chocolate bar with wrapper
es: Barra de chocolate con envoltura
fr: Barre de chocolat avec emballage
nl: Chocoladereep met verpakking

# CreditCardDesc
source: Credit card with chip and details
es: Tarjeta de crédito con chip y detalles
fr: Carte de crédit avec puce et détails
nl: Creditcard met chip en details

# FileDesc
source: Document file icon
es: Ícono de archivo de documento
fr: Icône de fichier document
nl: Documentbestandspictogram

# FolderDesc
source: Folder for organizing files
es: Carpeta para organizar archivos
fr: Dossier pour organiser les fichiers
nl: Map voor het organiseren van bestanden

# GhostDesc
source: Friendly floating ghost
es: Fantasma flotante amigable
fr: Fantôme flottant amical
nl: Vriendelijk zwevend spookje

# IceCreamDesc
source: Delicious ice cream cone
es: Delicioso cono de helado
fr: Délicieux cornet de glace
nl: Heerlijk ijshoorntje

# MugDesc
source: Coffee or tea mug with handle
es: Taza de café o té con asa
fr: Tasse à café ou thé avec poignée
nl: Koffie- of theemok met handvat

# PlanetDesc
source: Round planet in space
es: Planeta redondo en el espacio
fr: Planète ronde dans l'espace
nl: Ronde planeet in de ruimte

# SpeechBubbleDesc
source: Speech bubble for conversations
es: Bocadillo de diálogo para conversaciones
fr: Bulle de dialogue pour les conversations
nl: Tekstballon voor gesprekken

# AstronautDesc
source: A cute astronaut floating in space
es: Un lindo astronauta flotando en el espacio
nl: Een schattige astronaut zwevend in de ruimte

# CyborgDesc
source: A friendly cyborg with human emotions
es: Un cyborg amigable con emociones humanas
nl: Een vriendelijke cyborg met menselijke emoties

# HumanCatDesc
source: A human-cat hybrid with kawaii features
es: Un híbrido humano-gato con características kawaii
nl: Een mens-kat hybride met kawaii-kenmerken

# HumanDinosaurDesc
source: A playful dinosaur-human character
es: Un personaje dinosaurio-humano juguetón
nl: Een speels dinosaurus-mens personage

# PlaygroundTitle
source: Component Playground
es: Área de Pruebas de Componentes
fr: Terrain de jeu des composants
nl: Componenten Speeltuin

# PlaygroundSubtitle
source: Customize and preview kawaii components in real-time
es: Personaliza y previsualiza componentes kawaii en tiempo real
fr: Personnalisez et prévisualisez les composants kawaii en temps réel
nl: Pas kawaii-componenten aan en bekijk ze in real-time

source: Customize Component
es: Personalizar Componente
fr: Personnaliser le composant
nl: Component Aanpassen

source: Component
es: Componente
fr: Composant

source: Mood
es: Estado de Ánimo
fr: Humeur
nl: Stemming

source: Size
es: Tamaño
fr: Taille
nl: Grootte

source: Animation Effects
es: Efectos de Animación
fr: Effets d'animation
nl: Animatie-effecten

source: Rotation
es: Rotación
nl: Rotatie

source: Bounce
es: Rebote
fr: Rebond
nl: Stuiteren

source: Pulse
es: Pulso
fr: Pulsation
nl: Pulseren

source: Reset to Defaults
es: Restablecer a Valores Predeterminados
fr: Réinitialiser aux valeurs par défaut
nl: Herstellen naar Standaard

source: Preview
es: Vista Previa
fr: Aperçu
nl: Voorbeeld

source: Generated Code
es: Código Generado
fr: Code généré
nl: Gegenereerde Code

source: Copy to clipboard
es: Copiar al portapapeles
fr: Copier dans le presse-papiers
nl: Kopieer naar klembord

source: Copied!
es: ¡Copiado!
fr: Copié !
nl: Gekopieerd!

# SizePx
source: Size: {0} px
es: Tamaño: {0} px
fr: Taille : {0} px
nl: Grootte: {0} px

# DocumentationTitle
source: Documentation
es: Documentación
nl: Documentatie

# DocumentationSubtitle
source: Everything you need to know about using Blazor Kawaii components
es: Todo lo que necesitas saber sobre el uso de componentes Blazor Kawaii
fr: Tout ce que vous devez savoir sur l'utilisation des composants Blazor Kawaii
nl: Alles wat je moet weten over het gebruik van Blazor Kawaii-componenten

source: Table of Contents
es: Tabla de Contenidos
fr: Table des matières
nl: Inhoudsopgave

source: Getting Started
es: Primeros Pasos
fr: Pour commencer
nl: Aan de Slag

source: Installation
es: Instalación
nl: Installatie

source: Basic Usage
es: Uso Básico
fr: Utilisation de base
nl: Basisgebruik

source: Component Properties
es: Propiedades del Componente
fr: Propriétés des composants
nl: Component Eigenschappen

source: Moods
es: Estados de Ánimo
fr: Humeurs
nl: Stemmingen

source: Customization
es: Personalización
fr: Personnalisation
nl: Aanpassing

source: Examples
es: Ejemplos
fr: Exemples
nl: Voorbeelden

source: API Reference
es: Referencia de API
fr: Référence API
nl: API-referentie

# GettingStartedDesc
source: Blazor Kawaii is a collection of cute SVG illustrations that you can use as Blazor components. They are designed to add personality and fun to your applications while maintaining a professional look.
es: Blazor Kawaii es una colección de ilustraciones SVG adorables que puedes usar como componentes de Blazor. Están diseñados para agregar personalidad y diversión a tus aplicaciones mientras mantienen un aspecto profesional.
fr: Blazor Kawaii est une collection d'illustrations SVG mignonnes que vous pouvez utiliser comme composants Blazor. Elles sont conçues pour ajouter de la personnalité et du plaisir à vos applications tout en conservant un aspect professionnel.
nl: Blazor Kawaii is een collectie schattige SVG-illustraties die je kunt gebruiken als Blazor-componenten. Ze zijn ontworpen om persoonlijkheid en plezier toe te voegen aan je applicaties terwijl ze een professionele uitstraling behouden.

# GettingStartedDesc2
source: All components are built with customization in mind, allowing you to change colors, sizes, and moods to match your application's design.
es: Todos los componentes están construidos pensando en la personalización, permitiéndote cambiar colores, tamaños y estados de ánimo para que coincidan con el diseño de tu aplicación.
fr: Tous les composants sont conçus avec la personnalisation à l'esprit, vous permettant de modifier les couleurs, les tailles et les humeurs pour correspondre au design de votre application.
nl: Alle componenten zijn gebouwd met aanpassing in gedachten, waardoor je kleuren, groottes en stemmingen kunt wijzigen om bij het ontwerp van je applicatie te passen.

# InstallationDesc
source: To use Blazor Kawaii components in your project, follow these steps:
es: Para usar los componentes de Blazor Kawaii en tu proyecto, sigue estos pasos:
fr: Pour utiliser les composants Blazor Kawaii dans votre projet, suivez ces étapes :
nl: Om Blazor Kawaii-componenten in je project te gebruiken, volg deze stappen:

# CloneRepository
source: Clone the repository
es: Clonar el repositorio
fr: Cloner le dépôt
nl: Kloon de repository

# CopyComponents
source: Copy components to your project
es: Copiar componentes a tu proyecto
fr: Copier les composants dans votre projet
nl: Kopieer componenten naar je project

# CopyComponentsDesc
source: Copy the Components and Common folders to your Blazor project.
es: Copia las carpetas Components y Common a tu proyecto Blazor.
fr: Copiez les dossiers Components et Common dans votre projet Blazor.
nl: Kopieer de Components en Common mappen naar je Blazor-project.

# AddImports
source: Add necessary imports
es: Agregar importaciones necesarias
fr: Ajouter les imports nécessaires
nl: Voeg benodigde imports toe

# BasicUsageDesc
source: Using a Kawaii component is as simple as adding it to your Razor page:
es: Usar un componente Kawaii es tan simple como agregarlo a tu página Razor:
fr: Utiliser un composant Kawaii est aussi simple que de l'ajouter à votre page Razor :
nl: Het gebruik van een Kawaii-component is zo eenvoudig als het toevoegen aan je Razor-pagina:

# BasicUsageDesc2
source: This will render a cat component with default properties. You can customize it by passing parameters.
es: Esto renderizará un componente de gato con propiedades predeterminadas. Puedes personalizarlo pasando parámetros.
fr: Cela affichera un composant chat avec les propriétés par défaut. Vous pouvez le personnaliser en passant des paramètres.
nl: Dit zal een katcomponent weergeven met standaard eigenschappen. Je kunt het aanpassen door parameters door te geven.

# ComponentPropertiesDesc
source: All Kawaii components share the same set of properties:
es: Todos los componentes Kawaii comparten el mismo conjunto de propiedades:
fr: Tous les composants Kawaii partagent le même ensemble de propriétés :
nl: Alle Kawaii-componenten delen dezelfde set eigenschappen:

source: Property
es: Propiedad
fr: Propriété
nl: Eigenschap

source: Type
es: Tipo

source: Default
es: Predeterminado
fr: Défaut
nl: Standaard

source: Description
es: Descripción
nl: Beschrijving

# SizeDesc
source: The size of the component in pixels
es: El tamaño del componente en píxeles
fr: La taille du composant en pixels
nl: De grootte van het component in pixels

# MoodDesc
source: The facial expression of the component
es: La expresión facial del componente
fr: L'expression faciale du composant
nl: De gezichtsuitdrukking van het component

# ColorDesc
source: The primary color (hex format)
es: El color principal (formato hexadecimal)
fr: La couleur principale (format hexadécimal)
nl: De primaire kleur (hex-formaat)

# ClassNameDesc
source: Optional CSS class name
es: Nombre de clase CSS opcional
fr: Nom de classe CSS optionnel
nl: Optionele CSS-klassenaam

source: Varies by component
es: Varía según el componente
fr: Varie selon le composant
nl: Varieert per component

source: Example with all properties:
es: Ejemplo con todas las propiedades:
fr: Exemple avec toutes les propriétés :
nl: Voorbeeld met alle eigenschappen:

# MoodsDesc
source: Each component can express different emotions through the Mood property:
es: Cada componente puede expresar diferentes emociones a través de la propiedad Mood:
fr: Chaque composant peut exprimer différentes émotions grâce à la propriété Mood :
nl: Elk component kan verschillende emoties uitdrukken via de Stemming-eigenschap:

source: Styling with CSS
es: Estilización con CSS
fr: Style avec CSS
nl: Stijlen met CSS

# StylingWithCSSDesc
source: You can apply custom CSS classes to components:
es: Puedes aplicar clases CSS personalizadas a los componentes:
fr: Vous pouvez appliquer des classes CSS personnalisées aux composants :
nl: Je kunt aangepaste CSS-klassen toepassen op componenten:

source: Dynamic Properties
es: Propiedades Dinámicas
fr: Propriétés dynamiques
nl: Dynamische Eigenschappen

# DynamicPropertiesDesc
source: Bind component properties to variables for dynamic behavior:
es: Vincula las propiedades del componente a variables para comportamiento dinámico:
fr: Liez les propriétés des composants à des variables pour un comportement dynamique :
nl: Bind componenteigenschappen aan variabelen voor dynamisch gedrag:

source: Loading States
es: Estados de Carga
fr: États de chargement
nl: Laadtoestanden

source: Error States
es: Estados de Error
fr: États d'erreur
nl: Fouttoestanden

source: Empty States
es: Estados Vacíos
fr: États vides
nl: Lege Toestanden

# APIReferenceDesc
source: Complete list of available components and their default values:
es: Lista completa de componentes disponibles y sus valores predeterminados:
fr: Liste complète des composants disponibles et leurs valeurs par défaut :
nl: Volledige lijst van beschikbare componenten en hun standaardwaarden:

# DefaultSizeLabel
source: Default Size:
es: Tamaño Predeterminado:
nl: Standaardgrootte:

# DefaultColorLabel
source: Default Color:
es: Color Predeterminado:
nl: Standaardkleur:

source: Namespace:
es: Espacio de nombres:
fr: Espace de noms :

# PlaygroundCTA
source: For a complete interactive experience, visit the
es: Para una experiencia interactiva completa, visita el
fr: Pour une expérience interactive complète, visitez le
nl: Voor een complete interactieve ervaring, bezoek de

# PlaygroundCTA2
source: to experiment with all components and their properties.
es: para experimentar con todos los componentes y sus propiedades.
fr: pour expérimenter avec tous les composants et leurs propriétés.
nl: om te experimenteren met alle componenten en hun eigenschappen.

source: Install via NuGet
es: Instalar vía NuGet
nl: Installeren via NuGet

# RecommendedApproach
source: The recommended way to install BlazorKawaii
es: La forma recomendada de instalar BlazorKawaii
nl: De aanbevolen manier om BlazorKawaii te installeren

# OrViaPackageManager
source: Or via Package Manager Console:
es: O a través de la Consola del Administrador de Paquetes:
nl: Of via de Package Manager Console:

# AddToImports
source: Add to your _Imports.razor:
es: Agrega a tu _Imports.razor:
nl: Voeg toe aan je _Imports.razor:

# ThenUseComponents
source: Then use any component:
es: Luego usa cualquier componente:
nl: Gebruik vervolgens elk component:

# NuGetAvailable
source: BlazorKawaii is now available as a NuGet package for easy integration!
es: Disponible en NuGet
nl: Beschikbaar op NuGet

# AddToImportsFile
source: Add the following to your _Imports.razor file:
es: Agregar al archivo de importaciones
nl: Toevoegen aan imports bestand

# AlternativeMethod
source: Alternative: Install from Source
es: Método alternativo
nl: Alternatieve methode

# IfYouPreferSource
source: If you prefer to work with the source code or contribute to the project:
es: Si prefieres trabajar con el código fuente
nl: Als u liever met de broncode werkt

source: Based on
es: Basado en
nl: Gebaseerd op

source: by
es: por
nl: door

# AdaptedFor
source: Adapted for the Blazor community by
es: Adaptado para la comunidad Blazor por
nl: Aangepast voor de Blazor-gemeenschap door

source: Resources
es: Recursos
nl: Bronnen

source: Quick Tip
es: Consejo Rápido
nl: Snelle Tip

# QuickTipText
source: Press Ctrl+K to quickly search for components
es: Presiona Ctrl+K para buscar componentes rápidamente
nl: Druk op Ctrl+K om snel componenten te zoeken

source: Click to change mood
es: Haz clic para cambiar el estado de ánimo
nl: Klik om de stemming te veranderen

source: Dark Mode
es: Modo Oscuro
fr: Mode sombre
nl: Donkere Modus

source: Language
es: Idioma
fr: Langue
nl: Taal

source: Toggle Dark Mode
es: Alternar Modo Oscuro
fr: Basculer le mode sombre
nl: Donkere Modus Schakelen

source: GitHub Repository
es: Repositorio de GitHub
fr: Dépôt GitHub

source: Not found
es: No encontrado
fr: Page introuvable
nl: Niet gevonden

# NotFoundMessage
source: Sorry, there's nothing at this address.
es: Lo sentimos, no hay nada en esta dirección.
fr: Désolé, il n'y a rien à cette adresse.
nl: Sorry, er is niets op dit adres.

source: Best Practices
es: Mejores Prácticas
nl: Beste Praktijken

# BestPracticesDesc
source: Best practices for using BlazorKawaii components
es: Mejores prácticas para usar los componentes BlazorKawaii
nl: Beste praktijken voor het gebruik van BlazorKawaii-componenten

# BestPractice1
source: Use semantic HTML and ARIA attributes when wrapping Kawaii components
es: Use HTML semántico y atributos ARIA al envolver componentes Kawaii
nl: Gebruik semantische HTML en ARIA-attributen bij het inpakken van Kawaii-componenten

# BestPractice2
source: Choose appropriate moods that match your application's context
es: Elija estados de ánimo apropiados que coincidan con el contexto de su aplicación
nl: Kies passende stemmingen die overeenkomen met de context van uw applicatie

# BestPractice3
source: Keep component sizes consistent across your UI for visual harmony
es: Mantenga tamaños de componentes consistentes en su UI para armonía visual
nl: Houd componentgroottes consistent in uw UI voor visuele harmonie

# BestPractice4
source: Use CSS variables for theming to maintain consistency
es: Use variables CSS para temas para mantener la consistencia
nl: Gebruik CSS-variabelen voor thema's om consistentie te behouden

source: Troubleshooting
es: Solución de Problemas
nl: Probleemoplossing

# TroubleshootingDesc
source: Common issues and solutions
es: Problemas comunes y soluciones
nl: Veelvoorkomende problemen en oplossingen

# CommonIssue1
source: Components not rendering
es: Los componentes no se renderizan
nl: Componenten worden niet weergegeven
